#include "demo_motor.h"
//M1为右车轮使能端，低电平有效
//M2为右车轮转动方向，高电平和低电平反向
//M3为左车轮使能端，低电平有效
//M4为左车轮转动方向，高电平和低电平反向
/*
*********************************************************************************************************
*	函 数 名: motor_configuration
*	功能说明: 电机驱动初始化
*	形    参: PWM_fre:PWM频率参数（单位KHZ）,输入范围1-840
*	返 回 值: 无
*********************************************************************************************************
*/
//4.14改
void motor_configuration(u8 PWM_fre)
{
	u32 psc;
	psc = 840/PWM_fre;
	TIM5_PWM_Init(99,psc-1);     	   					 
	//TIM5->CCR1=0;  
	TIM5->CCR2=0;
	TIM5->CCR3=0;
	//TIM5->CCR4=0;
	RCC->AHB1ENR|=1<<6;    		//使能PORTG时钟
	RCC->AHB1ENR|=1<<5;				//使能F
	GPIO_Set(GPIOF,PIN14|PIN15,GPIO_MODE_OUT,GPIO_OTYPE_PP,GPIO_SPEED_100M,GPIO_PUPD_PD); //PF14,15设置,下拉
	GPIO_Set(GPIOG,PIN0|PIN1,GPIO_MODE_OUT,GPIO_OTYPE_PP,GPIO_SPEED_100M,GPIO_PUPD_PD);	//PG0,1设置下拉
	M1 = 0;
	M2 = 0;
	M3 = 0;
	M4 = 0;
}

/*
*********************************************************************************************************
*	函 数 名: CarAdvance
*	功能说明: 驱动小车前进
*	形    参: speed：小车速度，输入范围为0-100。（过小可能不工作）
*	返 回 值: 无
*********************************************************************************************************
*/

//M4=1  左轮反转  M4=0 左轮正转
//M3=1  左轮不转  M3=0 转


 void CarAdvance(u8 speed)
{
	M1 = 0;
	M2 = 1;
	M3 = 0;  
	M4 = 0;
	//TIM5->CCR1=speed;  
	TIM5->CCR2=speed;
	TIM5->CCR3=speed;
	//TIM5->CCR4=speed;
}

/*
*********************************************************************************************************
*	函 数 名: CarRetreat
*	功能说明: 驱动小车后退
*	形    参: speed：小车速度，输入范围为0-100。（过小可能不工作）
*	返 回 值: 无
*********************************************************************************************************
*/
void CarRetreat(u8 speed)
{
	M1 = 0;
	M2 = 0;
	M3 = 0;
	M4 = 1;
	//TIM5->CCR1=speed;  
	TIM5->CCR2=speed;
	TIM5->CCR3=speed;
	//TIM5->CCR4=speed;
}

/*
*********************************************************************************************************
*	函 数 名: SetLeftWhell
*	功能说明: 驱动小车左边轮
*	形    参:left_direction控制电机正反转（0或1）/ speed：小车左边轮速度，输入范围为0-100。（过小可能不工作）
*	返 回 值: 无
*********************************************************************************************************
*/
void SetLeftWhell(u8 left_direction,u8 speed)
{
	M1 = 0;
	M2 = left_direction;
	TIM5->CCR2=speed;
	//TIM5->CCR4=speed;
}

/*
*********************************************************************************************************
*	函 数 名: SetRightWhell
*	功能说明: 驱动小车右边轮
*	形    参:right_direction控制电机正反转（0或1）/ speed：小车右边轮速度，输入范围为0-100。（过小可能不工作） 
*	返 回 值: 无
*********************************************************************************************************
*/
void SetRightWhell(u8 right_direction,u8 speed)
{
	M3 = 0;
	M4 = right_direction;
	//TIM5->CCR1=speed;
	TIM5->CCR3=speed;
}

/*
*********************************************************************************************************
*	函 数 名: CarAdvance
*	功能说明: 小车停止
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void Stop(int engine)
{
	if(engine==1)
	{
		M1 = 0;M2 = 1;
		M3 = 0;M4 = 0;
	}
	else
	{
		M1 = 0;M2 = 0;
		M3 = 0;M4 = 1;
	}
	
	TIM5->CCR2=0;
	TIM5->CCR3=0;
}

