#include "fan.h"
#include "pwm.h"
//N1为风扇电机使能位
//N2为风扇的转动方向
/*
*********************************************************************************************************
*	函 数 名: fan_configuration
*	功能说明: 电机驱动初始化
*	形    参: fre:频率参数（单位KHZ）,输入范围1-840
*	返 回 值: 无
*********************************************************************************************************
*/
//4.14改
void fan_Init(u8 fre)
{
	u32 psc;
	psc = 840/fre;
	TIM8_PWM_Init(99,psc-1);     	   					 
	TIM8->CCR4=0;
	RCC->AHB1ENR|=1<<1;				//使能GPIOB时钟
	GPIO_Set(GPIOB,PIN13|PIN15,GPIO_MODE_OUT,GPIO_OTYPE_PP,GPIO_SPEED_100M,GPIO_PUPD_PD); //PB13,15设置,下拉
	N1 = 1;
	N2 = 0;
}
/*
*********************************************************************************************************
*	函 数 名: fan
*	功能说明: 风扇功能实现函数
*	形    参: button 0风扇启动/1关闭 aspect 控制风扇转向 0风扇正转/1反转
*	返 回 值: 无
*********************************************************************************************************
*/
//4.14改
void fan(int button,int aspect)
{
	N1 = button;
	N2 = aspect;
	TIM8->CCR4=20;
}

